[
    {
        "python": {"description": "Python is a versatile and widely-used programming language known for its simplicity and readability. It is commonly used for web development, data analysis, artificial intelligence, and more.", "photo": "placeholder.jpg"},
        "flask": {"description": "Flask is a lightweight web framework for Python, used to build web applications quickly and easily. It is known for its simplicity and flexibility.", "photo": "placeholder.jpg"},
        "jinja2": {"description": "Jinja2 is a popular templating engine for Python, often used with web frameworks like Flask. It allows developers to create dynamic HTML templates.", "photo": "placeholder.jpg"},
        "gimp": {"description": "GIMP (GNU Image Manipulation Program) is a free and open-source graphics editor used for tasks such as photo retouching, image composition, and image authoring.", "photo": "placeholder.jpg"},
        "LateX": {"description": "LaTeX is a typesetting system commonly used for creating documents that require complex formatting, such as academic papers, theses, and scientific documents.", "photo": "placeholder.jpg"},
        "html": {"description": "HTML (Hypertext Markup Language) is the standard markup language for creating web pages. It defines the structure and content of web documents.", "photo": "placeholder.jpg"},
        "ada": {"description": "Ada is a statically typed, high-level programming language known for its reliability and safety features. It is often used in critical systems and aerospace applications.", "photo": "placeholder.jpg"},
        "c++": {"description": "C++ is a powerful and versatile programming language used for a wide range of applications, including system programming, game development, and embedded systems.", "photo": "placeholder.jpg"},
        "csv": {"description": "CSV (Comma-Separated Values) is a simple file format used for storing tabular data, often used in spreadsheets and data analysis.", "photo": "placeholder.jpg"},
        "css": {"description": "CSS (Cascading Style Sheets) is a stylesheet language used for describing the presentation of web pages written in HTML. It controls the layout and design of web content.", "photo": "placeholder.jpg"},
        "java": {"description": "Java is a widely-used, object-oriented programming language known for its platform independence. It is commonly used in web and mobile app development.", "photo": "placeholder.jpg"},
        "javascript": {"description": "JavaScript is a popular scripting language used for adding interactivity to web pages. It is essential for front-end web development.", "photo": "placeholder.jpg"},
        "tensorflow": {"description": "TensorFlow is an open-source machine learning framework developed by Google. It is used for building and training machine learning models.", "photo": "placeholder.jpg"},
        "numpy": {"description": "NumPy is a Python library for numerical computing. It provides support for large, multi-dimensional arrays and matrices, along with mathematical functions to operate on them.", "photo": "placeholder.jpg"},
        "sql": {"description": "SQL (Structured Query Language) is a domain-specific language used for managing and querying relational databases.", "photo": "placeholder.jpg"},
        "mysql": {"description": "MySQL is a popular open-source relational database management system (RDBMS) used for storing and retrieving data in various applications.", "photo": "placeholder.jpg"},
        "android": {"description": "Android is a mobile operating system developed by Google. It powers a wide range of smartphones and tablets, and it offers a platform for mobile app development.", "photo": "placeholder.jpg"}
    }
]